"""
    高阶函数
"""

# ================================================== 变量可以指向函数 ==================================================
# 以Python内置的求绝对值的函数abs()为例，调用该函数用以下代码：
# abs(-10)

# print(abs(-10)) # ==> 10


# 如果只打印abs
# print(abs) # ==> <built-in function abs>

# 可见，abs(-10)是函数调用，而abs是函数本身

# 如果想要获得函数的调用结果，可以把结果赋值给变量：
# x = abs(-10)
# print(x) # ==> 10


# 但函数本身，其实也可以赋值给变量
# f = abs
# print(f) # ==> <built-in function abs>

# 所以，函数本身也可以赋值给变量，即：变量可以指向函数。

# 如果一个变量指向了一个函数，那么就可以通过该变量来调用这个函数
# f = abs
# print(f(-10)) # ==> 10




# ================================================== 函数名也是变量 ==================================================
# 函数名其实就是指向函数的变量！
# 对于abs()这个函数，完全可以把函数名abs看成变量，它指向一个可以计算绝对值的函数！

# 如果把 abs 指向其它对象
# abs = 10
# abs(-10) # ==> 报错

# 把abs指向10后，就无法通过abs(-10)调用该函数了！因为abs这个变量已经不指向求绝对值函数而是指向一个整数10！





# ================================================== 传入函数 ==================================================
# 既然变量可以指向函数，函数的参数能接收变量，那么一个函数就可以接收另一个函数作为参数，这种函数就称之为高阶函数。

# 示例
# def add(x, y, f):
#     return f(x) + f(y)
# print(add(-5, 6, abs)) # ==> 11

# 编写高阶函数，就是让函数的参数能够接收别的函数。

